Revit 2027 API
DirectShapeType.AddReferencePoint(XYZ, DirectShapeReferenceOptions) Method
 Adds a reference point to the DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferencePoint(
	XYZ refPoint,
	DirectShapeReferenceOptions options
)
Public Sub AddReferencePoint (
	refPoint As XYZ,
	options As DirectShapeReferenceOptions
)
public:
void AddReferencePoint(
	XYZ^ refPoint,
	DirectShapeReferenceOptions^ options
)
member AddReferencePoint :
        refPoint : XYZ *
        options : DirectShapeReferenceOptions -> unit
Parameters
refPoint XYZ
 The coordinates of the new reference point.
options DirectShapeReferenceOptions
 The options that are used to configure the new reference point.
Exceptions
Exception | Condition
ArgumentException |  The input point lies outside of Revit design limits. -or- options cannot be used to add a reference object to this DirectShapeType.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
AddReferencePoint Overload
Autodesk.Revit.DB Namespace